cases/irregular/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//libs            (overset fvMotionSolvers);

application     interFoam;

startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         500;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   5.0;

purgeWrite      0;

writeFormat     binary;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;//no;

maxCo           0.5;

maxAlphaCo      0.5;

maxDeltaT       0.05;

functions
{
 forces
    {
        type            forces;
        libs            (forces);
        patches         (float);
        rhoInf          1025.0;
        log             on;
        writeControl    writeTime;
        CofR            (0.0 0.0 -9.893);
    }
    
    sixDoFRigidBodyState
    {
        type           sixDoFRigidBodyState;
        libs           (sixDoFRigidBodyState);
        angleFormat    degrees;
        writeControl    writeTime;
    }
    waveProbes
    {
        type            interfaceHeight;
        libs            (fieldFunctionObjects);

        alpha           alpha.water;
        direction       (0 0 1);      // z-up: measure upward from probe location
        liquid          true;
        interpolationScheme cellPoint;

        // ADJUST THESE TO YOUR DOMAIN!
        // Place probes at y=0, z=0 (SWL) at several x-locations
        locations
        (
            (-50 0 0)    // near 1st offset
            (0    0 0)    // at structure centre
            (50  0 0)    // downstream of structure
            (150  0 0)    // near outlet
        );

        writeControl    writeTime;        
        writeToFile     true;
        log             true;
    }
    vorticity
    {
        type            vorticity;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        writeFields     true;
    }

    Qcriterion
    {
        type            Q;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        writeFields     true;
    }

}


// ************************************************************************* //
