cases/irregular/constant/waveProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
//  Pierson-Moskowitz irregular wave (auto-generated 2026-03-04 06:33)
//  Hs = 2.4400 m,  Ts(=Tp) = 8.100 s,  fp = 0.12346 Hz
//  N = 100 components,  f = [0.06173, 0.49383] Hz
//  Hs(recon) = 2.4341 m,  error = 0.244%
//  Energy captured = 99.51%,  T01 = 6.348 s,  Tz = 5.980 s
//  seed = 12345,  ramp = 32.4 s
//

inlet
{
    alpha           alpha.water;
    waveModel       irregularMultiDirectional;
    nPaddle         1;

    // PM irregular sea: Hs = 2.4400 m, Ts = 8.100 s (100 components)
    rampTime        32.4;
    activeAbsorption yes;
    waveAngle       0.0;

    wavePeriods     1((15.652174 14.660633 13.787234 13.012048 12.319392 11.696751 11.134021 10.622951 10.156740 9.729730 9.337176 8.975069 8.640000 8.329049 8.039702 7.769784 7.517401 7.280899 7.058824 6.849894 6.652977 6.467066 6.291262 6.124764 5.966851 5.816876 5.674256 5.538462 5.409015 5.285481 5.167464 5.054602 4.946565 4.843049 4.743777 4.648494 4.556962 4.468966 4.384303 4.302789 4.224250 4.148528 4.075472 4.004944 3.936817 3.870968 3.807286 3.745665 3.686007 3.628219 3.572216 3.517915 3.465241 3.414120 3.364486 3.316274 3.269425 3.223881 3.179588 3.136496 3.094556 3.053723 3.013953 2.975207 2.937443 2.900627 2.864721 2.829694 2.795513 2.762148 2.729570 2.697752 2.666667 2.636290 2.606597 2.577566 2.549174 2.521401 2.494226 2.467631 2.441598 2.416107 2.391144 2.366691 2.342733 2.319256 2.296244 2.273684 2.251564 2.229869 2.208589 2.187711 2.167224 2.147117 2.127380 2.108003 2.088975 2.070288 2.051932 2.033898));
    waveHeights     1((0.000615 0.003887 0.014370 0.036764 0.072656 0.119416 0.171709 0.223776 0.271043 0.310692 0.341541 0.363607 0.377645 0.384775 0.386224 0.383176 0.376687 0.367658 0.356830 0.344801 0.332037 0.318900 0.305664 0.292531 0.279650 0.267125 0.255027 0.243402 0.232274 0.221657 0.211551 0.201948 0.192836 0.184200 0.176019 0.168275 0.160945 0.154010 0.147446 0.141235 0.135356 0.129789 0.124518 0.119523 0.114788 0.110299 0.106040 0.101998 0.098159 0.094512 0.091045 0.087748 0.084610 0.081623 0.078777 0.076064 0.073478 0.071010 0.068654 0.066403 0.064253 0.062197 0.060231 0.058349 0.056547 0.054821 0.053167 0.051581 0.050059 0.048599 0.047197 0.045851 0.044557 0.043313 0.042117 0.040966 0.039858 0.038792 0.037764 0.036774 0.035820 0.034900 0.034012 0.033156 0.032329 0.031530 0.030759 0.030014 0.029294 0.028597 0.027923 0.027272 0.026641 0.026030 0.025439 0.024866 0.024312 0.023774 0.023253 0.022747));
    wavePhases      1((81.841 114.033 287.052 243.452 140.799 119.813 215.391 67.224 242.192 339.049 89.368 341.597 240.205 34.523 159.062 319.133 251.083 117.530 264.214 79.249 29.374 57.562 122.436 167.470 95.912 293.680 69.586 46.609 32.999 215.484 307.707 216.584 335.516 260.921 309.798 334.562 196.627 337.562 178.196 98.558 162.640 239.414 119.121 325.243 92.547 122.338 93.187 127.961 1.808 226.298 101.658 24.512 222.058 63.477 109.580 158.719 54.073 78.454 170.760 171.493 91.884 107.123 100.464 93.809 173.794 76.312 178.427 88.654 301.854 64.847 310.376 64.188 270.191 220.003 75.296 273.554 89.734 30.806 222.500 193.309 228.430 62.775 89.339 246.536 29.114 315.026 154.330 222.622 112.718 64.427 3.496 75.615 313.200 350.219 159.045 136.350 99.341 347.797 20.953 147.144));
    waveDirs        1((0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0));
}

outlet
{
    alpha           alpha.water;
    waveModel       shallowWaterAbsorption;
    nPaddle         1;
}

// ************************************************************************* //
