cases/irregular/0.orig/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    

    inlet
    {
        type            waveAlpha;
        value           uniform 0;
    }

    outlet
    {
        type            waveAlpha;
        value           uniform 0;
    }

    top
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
	
	sides
    {
        type            zeroGradient;
    }
	
	bottom
    {
        type            zeroGradient;
    }

    float
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
